koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
/*
 * Copyright (C) 2021-2025 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef ADUC7023_H_
#define ADUC7023_H_

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

#include <stdint.h>
#include <Core/Arm/core_arm.h>
#include "system_aduc7023.h"

/*------------------------------------------------------------------------------
 *                                IRQ
 *----------------------------------------------------------------------------*/
/**
 * @brief Interrupt Number Definition
 */
typedef enum {
  ANY_FIQ_IRQn      = 0,    /*!< All interrupts OR’ed (FIQ only)              */
  SWI_IRQn          = 1,    /*!< Software Interrupt                           */
  RTOS_TIMER_IRQn   = 2,    /*!< RTOS Timer Interrupt                         */
  GP_TIMER_IRQn     = 3,    /*!< General-Purpose Timer Interrupt              */
  WDG_TIMER_IRQn    = 4,    /*!< Watchdog Timer Interrupt                     */
  FLASH_IRQn        = 5,    /*!< Flash Interrupt                              */
  ADC_IRQn          = 6,    /*!< ADC Interrupt                                */
  PLL_IRQn          = 7,    /*!< PLL Interrupt                                */
  I2C0_MASTER_IRQn  = 8,    /*!< I2C0 Master Interrupt                        */
  I2C0_SLAVE_IRQn   = 9,    /*!< I2C0 Slave Interrupt                         */
  I2C1_MASTER_IRQn  = 10,   /*!< I2C1 Master Interrupt                        */
  I2C1_SLAVE_IRQn   = 11,   /*!< I2C1 Slave Interrupt                         */
  SPI_IRQn          = 12,   /*!< SPI Interrupt                                */
  EXT_IRQ0_IRQn     = 13,   /*!< External IRQ0 Interrupt                      */
  COMPARATOR_IRQn   = 14,   /*!< Comparator Interrupt                         */
  PSM_IRQn          = 15,   /*!< PSM Interrupt                                */
  EXT_IRQ1_IRQn     = 16,   /*!< External IRQ1 Interrupt                      */
  PLA_IRQ0_IRQn     = 17,   /*!< PLA IRQ0 Interrupt                           */
  EXT_IRQ2_IRQn     = 18,   /*!< External IRQ2 Interrupt                      */
  EXT_IRQ3_IRQn     = 19,   /*!< External IRQ3 Interrupt                      */
  PLA_IRQ1_IRQn     = 20,   /*!< PLA IRQ1 Interrupt                           */
  PWM_IRQn          = 21,   /*!< PWM Interrupt                                */
  IRQ_VECTOR_COUNT  = 22,
  IRQn_Reserved     = 0x7FFFFFFF
} IRQn_t;

/**
 * @brief Interrupt Priority Definition
 */
typedef enum {
  IRQ_PriorityRealtime    = 0,
  IRQ_PriorityAboveHigh   = 1,
  IRQ_PriorityHigh        = 2,
  IRQ_PriorityAboveNormal = 3,
  IRQ_PriorityNormal      = 4,
  IRQ_PriorityBelowNormal = 5,
  IRQ_PriorityAboveLow    = 6,
  IRQ_PriorityLow         = 7,
  IRQ_Priority_Reserved   = 0x7FFFFFFF
} IRQ_Priority_t;

/**
 * @brief Interrupt Controller
 */
typedef struct IRQ_s {
  __IM  uint32_t STA;     /*!< Active IRQ source                              */
  __IM  uint32_t SIG;     /*!< Current state of all IRQ sources
                               (enabled and disabled)                         */
  __IOM uint32_t EN;      /*!< Enabled IRQ sources.                           */
  __OM  uint32_t CLR;     /*!< Disable IRQ sources                            */
  __OM  uint32_t SWICFG;  /*!< Software interrupt configuration               */
  __IOM uint32_t BASE;    /*!< Base address of all vectors. Points to start of
                               a 64-byte memory block which can contain up to
                               32 pointers to separate subroutine handlers.   */
  RESERVED(0, uint32_t);
  __IM  uint32_t VEC;     /*!< This register contains the subroutine address
                               for the currently active IRQ source.           */
  __IOM uint32_t P[3];    /*!< This register contains the interrupt priority
                               setting for Interrupt Source.                  */
  RESERVED(1, uint32_t);
  __IOM uint32_t CONN;    /*!< Used to enable IRQ and FIQ interrupt nesting.  */
  struct EXT_IRQ {
    __IOM uint32_t CONE;  /*!< This register configures the external interrupt
                               sources as rising edge, falling edge, or level
                               triggered.                                     */
    __IOM uint32_t CLRE;  /*!< Used to clear an edge level triggered interrupt
                               source.                                        */
  } EXT_IRQ;
  __IOM uint32_t STAN;    /*!< This register indicates the priority level of
                               an interrupt that has just caused an interrupt
                               exception.                                     */
} IRQ_t;

#define IRQ_SWICFG_Pos            (1U)
#define IRQ_SWICFG_Msk            (0x3U << IRQ_SWICFG_Pos)
#define IRQ_SWICFG                IRQ_SWICFG_Msk
#define IRQ_SWICFG_0              (0x1U << IRQ_SWICFG_Pos)
#define IRQ_SWICFG_1              (0x2U << IRQ_SWICFG_Pos)

#define IRQ_BASER_Pos             (0U)
#define IRQ_BASER_Msk             (0xFFFFU << IRQ_BASER_Pos)
#define IRQ_BASER                 IRQ_BASER_Msk

#define IRQ_VEC_ID_Pos            (2U)
#define IRQ_VEC_ID_Msk            (0x1FU << IRQ_VEC_ID_Pos)
#define IRQ_VEC_ID                IRQ_VEC_ID_Msk

#define IRQ_VEC_BASE_Pos          (7U)
#define IRQ_VEC_BASE_Msk          (0xFFFFU << IRQ_VEC_BASE_Pos)
#define IRQ_VEC_BASE              IRQ_VEC_BASE_Msk

#define IRQ_CONN_ENIRQN_Pos       (0U)
#define IRQ_CONN_ENIRQN_Msk       (0x1U << IRQ_CONN_ENIRQN_Pos)
#define IRQ_CONN_ENIRQN           IRQ_CONN_ENIRQN_Msk

#define IRQ_CONN_ENFIQN_Pos       (1U)
#define IRQ_CONN_ENFIQN_Msk       (0x1U << IRQ_CONN_ENFIQN_Pos)
#define IRQ_CONN_ENFIQN           IRQ_CONN_ENFIQN_Msk

/********************  Bit definition for IRQCONE register  *******************/
#define IRQ_CONE_IRQ0SRC_Pos      (0U)
#define IRQ_CONE_IRQ0SRC_Msk      (0x3U << IRQ_CONE_IRQ0SRC_Pos)
#define IRQ_CONE_IRQ0SRC          IRQ_CONE_IRQ0SRC_Msk

#define IRQ_CONE_IRQ1SRC_Pos      (2U)
#define IRQ_CONE_IRQ1SRC_Msk      (0x3U << IRQ_CONE_IRQ1SRC_Pos)
#define IRQ_CONE_IRQ1SRC          IRQ_CONE_IRQ1SRC_Msk

