koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
#define IRQ_CONE_PLA0SRC_Pos      (4U)
#define IRQ_CONE_PLA0SRC_Msk      (0x3U << IRQ_CONE_PLA0SRC_Pos)
#define IRQ_CONE_PLA0SRC          IRQ_CONE_PLA0SRC_Msk

#define IRQ_CONE_IRQ2SRC_Pos      (6U)
#define IRQ_CONE_IRQ2SRC_Msk      (0x3U << IRQ_CONE_IRQ2SRC_Pos)
#define IRQ_CONE_IRQ2SRC          IRQ_CONE_IRQ2SRC_Msk

#define IRQ_CONE_IRQ3SRC_Pos      (8U)
#define IRQ_CONE_IRQ3SRC_Msk      (0x3U << IRQ_CONE_IRQ3SRC_Pos)
#define IRQ_CONE_IRQ3SRC          IRQ_CONE_IRQ3SRC_Msk

#define IRQ_CONE_PLA1SRC_Pos      (10U)
#define IRQ_CONE_PLA1SRC_Msk      (0x3U << IRQ_CONE_PLA1SRC_Pos)
#define IRQ_CONE_PLA1SRC          IRQ_CONE_PLA1SRC_Msk

/********************  Bit definition for IRQCLRE register  *******************/
#define IRQ_CLRE_IRQ0CLRI_Pos     (13U)
#define IRQ_CLRE_IRQ0CLRI_Msk     (0x1U << IRQ_CLRE_IRQ0CLRI_Pos)
#define IRQ_CLRE_IRQ0CLRI         IRQ_CLRE_IRQ0CLRI_Msk

#define IRQ_CLRE_IRQ1CLRI_Pos     (16U)
#define IRQ_CLRE_IRQ1CLRI_Msk     (0x1U << IRQ_CLRE_IRQ1CLRI_Pos)
#define IRQ_CLRE_IRQ1CLRI         IRQ_CLRE_IRQ1CLRI_Msk

#define IRQ_CLRE_PLA0CLRI_Pos     (17U)
#define IRQ_CLRE_PLA0CLRI_Msk     (0x1U << IRQ_CLRE_PLA0CLRI_Pos)
#define IRQ_CLRE_PLA0CLRI         IRQ_CLRE_PLA0CLRI_Msk

#define IRQ_CLRE_IRQ2CLRI_Pos     (18U)
#define IRQ_CLRE_IRQ2CLRI_Msk     (0x1U << IRQ_CLRE_IRQ2CLRI_Pos)
#define IRQ_CLRE_IRQ2CLRI         IRQ_CLRE_IRQ2CLRI_Msk

#define IRQ_CLRE_IRQ3CLRI_Pos     (19U)
#define IRQ_CLRE_IRQ3CLRI_Msk     (0x1U << IRQ_CLRE_IRQ3CLRI_Pos)
#define IRQ_CLRE_IRQ3CLRI         IRQ_CLRE_IRQ3CLRI_Msk

#define IRQ_CLRE_PLA1CLRI_Pos     (20U)
#define IRQ_CLRE_PLA1CLRI_Msk     (0x1U << IRQ_CLRE_PLA1CLRI_Pos)
#define IRQ_CLRE_PLA1CLRI         IRQ_CLRE_PLA1CLRI_Msk

/**
 * @brief Fast Interrupt Controller
 */
typedef struct FIQ_s {
  __IM  uint32_t STA;     /*!< Active FIQ source */
  __IM  uint32_t SIG;     /*!< Current state of all FIQ sources
                               (enabled and disabled)                         */
  __IOM uint32_t EN;      /*!< Enabled FIQ sources. */
  __OM  uint32_t CLR;     /*!< Disable FIQ sources */
  RESERVED(0[4], uint32_t);
  __IM  uint32_t VEC;     /*!< FIQ interrupt vector.                          */
  __IOM uint32_t STAN;    /*!< This register indicates the priority level of
                               an FIQ that has just caused an FIQ exception.  */
} FIQ_t;

#define FIQ_VEC_ID_Pos            (2U)
#define FIQ_VEC_ID_Msk            (0x1FU << FIQ_VEC_ID_Pos)
#define FIQ_VEC_ID                FIQ_VEC_ID_Msk

#define FIQ_VEC_BASE_Pos          (7U)
#define FIQ_VEC_BASE_Msk          (0xFFFFU << FIQ_VEC_BASE_Pos)
#define FIQ_VEC_BASE              FIQ_VEC_BASE_Msk

#define IRQ_PRIORITY_BIT_Msk      (7U)
#define IRQ_PRIORITY_IDX(irqn)    ((uint32_t)irqn >> 3U)
#define IRQ_PRIORITY_OFS(irqn)    (((uint32_t)irqn & IRQ_PRIORITY_BIT_Msk) << 2U)

#define IRQ_CLR_DEF_VALUE         (0xFFFFFFFFUL)
#define FIQ_CLR_DEF_VALUE         (0xFFFFFFFFUL)
#define IRQ_PRIO_DEF_VALUE        (0x00000000UL)

/*------------------------------------------------------------------------------
 *                          SYSTEM CONTROL
 *----------------------------------------------------------------------------*/
/**
 * @brief System Control
 */
typedef struct SYS_s {
  __IOM uint32_t REMAP;   /*!< Remap control register. */
  RESERVED(0[3], uint32_t);
  __IOM uint32_t RSTSTA;  /*!< RSTSTA status MMR. */
  __OM  uint32_t RSTCLR;  /*!< RSTCLR MMR for clearing RSTSTA register. */
  RESERVED(1[4], uint32_t);
  __OM  uint32_t RSTKEY1; /*!< 0x76 should be written to this register before
                               writing to RSTCFG. */
  __IOM uint32_t RSTCFG;  /*!< This register allows the DAC and GPIO outputs to
                               retain state after a watchdog or software
                               reset. */
  __OM  uint32_t RSTKEY2; /*!< 0xB1 should be written to this register after
                               writing to RSTCFG. */
} SYS_t;

/********************  Bit definition for REMAP register  *********************/
#define SYS_REMAP_SRAM_Pos        (0U)
#define SYS_REMAP_SRAM_Msk        (0x1UL << SYS_REMAP_SRAM_Pos)
#define SYS_REMAP_SRAM            SYS_REMAP_SRAM_Msk

/********************  Bit definition for RSTSTA register  ********************/
#define SYS_RSTSTA_POR_Pos        (0U)
#define SYS_RSTSTA_POR_Msk        (0x1UL << SYS_RSTSTA_POR_Pos)
#define SYS_RSTSTA_POR            SYS_RSTSTA_POR_Msk

#define SYS_RSTSTA_WDR_Pos        (1U)
#define SYS_RSTSTA_WDR_Msk        (0x1UL << SYS_RSTSTA_WDR_Pos)
#define SYS_RSTSTA_WDR            SYS_RSTSTA_WDR_Msk

#define SYS_RSTSTA_SWR_Pos        (2U)
#define SYS_RSTSTA_SWR_Msk        (0x1UL << SYS_RSTSTA_SWR_Pos)
#define SYS_RSTSTA_SWR            SYS_RSTSTA_SWR_Msk

/********************  Bit definition for RSTCLR register  ********************/
#define SYS_RSTCLR_POR_Pos        (0U)
#define SYS_RSTCLR_POR_Msk        (0x1UL << SYS_RSTCLR_POR_Pos)
#define SYS_RSTCLR_POR            SYS_RSTCLR_POR_Msk

#define SYS_RSTCLR_WDR_Pos        (1U)
#define SYS_RSTCLR_WDR_Msk        (0x1UL << SYS_RSTCLR_WDR_Pos)
#define SYS_RSTCLR_WDR            SYS_RSTCLR_WDR_Msk

#define SYS_RSTCLR_SWR_Pos        (2U)
#define SYS_RSTCLR_SWR_Msk        (0x1UL << SYS_RSTCLR_SWR_Pos)
#define SYS_RSTCLR_SWR            SYS_RSTCLR_SWR_Msk

/********************  Bit definition for RSTCFG register  ********************/
#define SYS_RSTCFG_GPIO_HOLD_Pos  (0U)
#define SYS_RSTCFG_GPIO_HOLD_Msk  (0x1UL << SYS_RSTCFG_GPIO_HOLD_Pos)
#define SYS_RSTCFG_GPIO_HOLD      SYS_RSTCFG_GPIO_HOLD_Msk

#define SYS_RSTCFG_DAC_HOLD_Pos   (2U)
#define SYS_RSTCFG_DAC_HOLD_Msk   (0x1UL << SYS_RSTCFG_DAC_HOLD_Pos)
#define SYS_RSTCFG_DAC_HOLD       SYS_RSTCFG_DAC_HOLD_Msk

/********************  Bit definition for RSTKEY registers ********************/
#define SYS_RSTKEY1_VALUE         (0x76UL)
#define SYS_RSTKEY2_VALUE         (0xB1UL)

/*------------------------------------------------------------------------------
 *                               GPIO
 *----------------------------------------------------------------------------*/
#define GP0CON                    (volatile uint32_t *) 0xFFFFF400
#define GP1CON                    (volatile uint32_t *) 0xFFFFF404
#define GP2CON                    (volatile uint32_t *) 0xFFFFF408
#define GP0DAT                    (volatile uint32_t *) 0xFFFFF420
#define GP0SET                    (volatile uint32_t *) 0xFFFFF424
#define GP0CLR                    (volatile uint32_t *) 0xFFFFF428
#define GP0PAR                    (volatile uint32_t *) 0xFFFFF42C
#define GP1DAT                    (volatile uint32_t *) 0xFFFFF430
#define GP1SET                    (volatile uint32_t *) 0xFFFFF434
#define GP1CLR                    (volatile uint32_t *) 0xFFFFF438
#define GP1PAR                    (volatile uint32_t *) 0xFFFFF43C
#define GP2DAT                    (volatile uint32_t *) 0xFFFFF440
#define GP2SET                    (volatile uint32_t *) 0xFFFFF444
#define GP2CLR                    (volatile uint32_t *) 0xFFFFF448
#define GP2PAR                    (volatile uint32_t *) 0xFFFFF44C

#define GPIO_CON_P0_Pos           (0U)
#define GPIO_CON_P0_Msk           (0x3U << GPIO_CON_P0_Pos)
#define GPIO_CON_P0               GPIO_CON_P0_Msk
#define GPIO_CON_P0_0             (0x1U << GPIO_CON_P0_Pos)
#define GPIO_CON_P0_1             (0x2U << GPIO_CON_P0_Pos)

