koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
#define GPIO_CON_P1_Pos           (4U)
#define GPIO_CON_P1_Msk           (0x3U << GPIO_CON_P1_Pos)
#define GPIO_CON_P1               GPIO_CON_P1_Msk
#define GPIO_CON_P1_0             (0x1U << GPIO_CON_P1_Pos)
#define GPIO_CON_P1_1             (0x2U << GPIO_CON_P1_Pos)

#define GPIO_CON_P2_Pos           (8U)
#define GPIO_CON_P2_Msk           (0x3U << GPIO_CON_P2_Pos)
#define GPIO_CON_P2               GPIO_CON_P2_Msk
#define GPIO_CON_P2_0             (0x1U << GPIO_CON_P2_Pos)
#define GPIO_CON_P2_1             (0x2U << GPIO_CON_P2_Pos)

#define GPIO_CON_P3_Pos           (12U)
#define GPIO_CON_P3_Msk           (0x3U << GPIO_CON_P3_Pos)
#define GPIO_CON_P3               GPIO_CON_P3_Msk
#define GPIO_CON_P3_0             (0x1U << GPIO_CON_P3_Pos)
#define GPIO_CON_P3_1             (0x2U << GPIO_CON_P3_Pos)

#define GPIO_CON_P4_Pos           (16U)
#define GPIO_CON_P4_Msk           (0x3U << GPIO_CON_P4_Pos)
#define GPIO_CON_P4               GPIO_CON_P4_Msk
#define GPIO_CON_P4_0             (0x1U << GPIO_CON_P4_Pos)
#define GPIO_CON_P4_1             (0x2U << GPIO_CON_P4_Pos)

#define GPIO_CON_P5_Pos           (20U)
#define GPIO_CON_P5_Msk           (0x3U << GPIO_CON_P5_Pos)
#define GPIO_CON_P5               GPIO_CON_P5_Msk
#define GPIO_CON_P5_0             (0x1U << GPIO_CON_P5_Pos)
#define GPIO_CON_P5_1             (0x2U << GPIO_CON_P5_Pos)

#define GPIO_CON_P6_Pos           (24U)
#define GPIO_CON_P6_Msk           (0x3U << GPIO_CON_P6_Pos)
#define GPIO_CON_P6               GPIO_CON_P6_Msk
#define GPIO_CON_P6_0             (0x1U << GPIO_CON_P6_Pos)
#define GPIO_CON_P6_1             (0x2U << GPIO_CON_P6_Pos)

#define GPIO_CON_P7_Pos           (28U)
#define GPIO_CON_P7_Msk           (0x3U << GPIO_CON_P7_Pos)
#define GPIO_CON_P7               GPIO_CON_P7_Msk
#define GPIO_CON_P7_0             (0x1U << GPIO_CON_P7_Pos)
#define GPIO_CON_P7_1             (0x2U << GPIO_CON_P7_Pos)

#define GPIO_PAR_P0_Pos           (0U)
#define GPIO_PAR_P0_Msk           (0x7U << GPIO_PAR_P0_Pos)
#define GPIO_PAR_P0               GPIO_PAR_P0_Msk
#define GPIO_PAR_P0_0             (0x1U << GPIO_PAR_P0_Pos)
#define GPIO_PAR_P0_1             (0x2U << GPIO_PAR_P0_Pos)
#define GPIO_PAR_P0_2             (0x4U << GPIO_PAR_P0_Pos)

#define GPIO_PAR_P1_Pos           (4U)
#define GPIO_PAR_P1_Msk           (0x7U << GPIO_PAR_P1_Pos)
#define GPIO_PAR_P1               GPIO_PAR_P1_Msk
#define GPIO_PAR_P1_0             (0x1U << GPIO_PAR_P1_Pos)
#define GPIO_PAR_P1_1             (0x2U << GPIO_PAR_P1_Pos)
#define GPIO_PAR_P1_2             (0x4U << GPIO_PAR_P1_Pos)

#define GPIO_PAR_P2_Pos           (8U)
#define GPIO_PAR_P2_Msk           (0x7U << GPIO_PAR_P2_Pos)
#define GPIO_PAR_P2               GPIO_PAR_P2_Msk
#define GPIO_PAR_P2_0             (0x1U << GPIO_PAR_P2_Pos)
#define GPIO_PAR_P2_1             (0x2U << GPIO_PAR_P2_Pos)
#define GPIO_PAR_P2_2             (0x4U << GPIO_PAR_P2_Pos)

#define GPIO_PAR_P3_Pos           (12U)
#define GPIO_PAR_P3_Msk           (0x7U << GPIO_PAR_P3_Pos)
#define GPIO_PAR_P3               GPIO_PAR_P3_Msk
#define GPIO_PAR_P3_0             (0x1U << GPIO_PAR_P3_Pos)
#define GPIO_PAR_P3_1             (0x2U << GPIO_PAR_P3_Pos)
#define GPIO_PAR_P3_2             (0x4U << GPIO_PAR_P3_Pos)

#define GPIO_PAR_P4_Pos           (16U)
#define GPIO_PAR_P4_Msk           (0x7U << GPIO_PAR_P4_Pos)
#define GPIO_PAR_P4               GPIO_PAR_P4_Msk
#define GPIO_PAR_P4_0             (0x1U << GPIO_PAR_P4_Pos)
#define GPIO_PAR_P4_1             (0x2U << GPIO_PAR_P4_Pos)
#define GPIO_PAR_P4_2             (0x4U << GPIO_PAR_P4_Pos)

#define GPIO_PAR_P5_Pos           (20U)
#define GPIO_PAR_P5_Msk           (0x7U << GPIO_PAR_P5_Pos)
#define GPIO_PAR_P5               GPIO_PAR_P5_Msk
#define GPIO_PAR_P5_0             (0x1U << GPIO_PAR_P5_Pos)
#define GPIO_PAR_P5_1             (0x2U << GPIO_PAR_P5_Pos)
#define GPIO_PAR_P5_2             (0x4U << GPIO_PAR_P5_Pos)

#define GPIO_PAR_P6_Pos           (24U)
#define GPIO_PAR_P6_Msk           (0x7U << GPIO_PAR_P6_Pos)
#define GPIO_PAR_P6               GPIO_PAR_P6_Msk
#define GPIO_PAR_P6_0             (0x1U << GPIO_PAR_P6_Pos)
#define GPIO_PAR_P6_1             (0x2U << GPIO_PAR_P6_Pos)
#define GPIO_PAR_P6_2             (0x4U << GPIO_PAR_P6_Pos)

#define GPIO_PAR_P7_Pos           (28U)
#define GPIO_PAR_P7_Msk           (0x7U << GPIO_PAR_P7_Pos)
#define GPIO_PAR_P7               GPIO_PAR_P7_Msk
#define GPIO_PAR_P7_0             (0x1U << GPIO_PAR_P7_Pos)
#define GPIO_PAR_P7_1             (0x2U << GPIO_PAR_P7_Pos)
#define GPIO_PAR_P7_2             (0x4U << GPIO_PAR_P7_Pos)

#define GPIO_DAT_INPUT_Pos        (0U)
#define GPIO_DAT_INPUT_Msk        (0xFF << GPIO_DAT_INPUT_Pos)
#define GPIO_DAT_INPUT            GPIO_DAT_INPUT_Msk

#define GPIO_DAT_RESET_Pos        (8U)
#define GPIO_DAT_RESET_Msk        (0xFF << GPIO_DAT_RESET_Pos)
#define GPIO_DAT_RESET            GPIO_DAT_RESET_Msk

#define GPIO_DAT_OUTPUT_Pos       (16U)
#define GPIO_DAT_OUTPUT_Msk       (0xFF << GPIO_DAT_OUTPUT_Pos)
#define GPIO_DAT_OUTPUT           GPIO_DAT_OUTPUT_Msk

#define GPIO_DAT_DIR_Pos          (24U)
#define GPIO_DAT_DIR_Msk          (0xFF << GPIO_DAT_DIR_Pos)
#define GPIO_DAT_DIR              GPIO_DAT_DIR_Msk

#define GPIO_SET_BIT_Pos          (16U)
#define GPIO_SET_BIT_Msk          (0xFF << GPIO_SET_BIT_Pos)
#define GPIO_SET_BIT              GPIO_SET_BIT_Msk

#define GPIO_CLR_BIT_Pos          (16U)
#define GPIO_CLR_BIT_Msk          (0xFF << GPIO_CLR_BIT_Pos)
#define GPIO_CLR_BIT              GPIO_CLR_BIT_Msk


/*------------------------------------------------------------------------------
 *                             RTOS TIMER
 *----------------------------------------------------------------------------*/
/**
 * @brief RTOS Timer
 */
typedef struct RTOS_TIMER_s {
  __IOM uint16_t LD;      /*!< Timer load register                            */
  RESERVED(0, uint16_t);
  __IM  uint16_t VAL;     /*!< Timer value register                           */
  RESERVED(1, uint16_t);
  __IOM uint16_t CON;     /*!< Timer control register                         */
  RESERVED(2, uint16_t);
  __OM  uint8_t  CLRI;    /*!< Timer interrupt clear register                 */
  RESERVED(3, uint8_t);
} RTOS_TIMER_t;

#define RTOS_TIMER_LD_Pos         (0U)
#define RTOS_TIMER_LD_Msk         (0xFFFFU << RTOS_TIMER_LD_Pos)
#define RTOS_TIMER_LD             RTOS_TIMER_LD_Msk

#define RTOS_TIMER_VAL_Pos        (0U)
#define RTOS_TIMER_VAL_Msk        (0xFFFFU << RTOS_TIMER_VAL_Pos)
#define RTOS_TIMER_VAL            RTOS_TIMER_VAL_Msk

#define RTOS_TIMER_CON_PSC_Pos    (2U)
#define RTOS_TIMER_CON_PSC_Msk    (0x3U << RTOS_TIMER_CON_PSC_Pos)
#define RTOS_TIMER_CON_PSC        RTOS_TIMER_CON_PSC_Msk
#define RTOS_TIMER_CON_PSC_0      (0x1U << RTOS_TIMER_CON_PSC_Pos)
#define RTOS_TIMER_CON_PSC_1      (0x2U << RTOS_TIMER_CON_PSC_Pos)

