koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
#define RTOS_TIMER_CON_CLK_Pos    (4U)
#define RTOS_TIMER_CON_CLK_Msk    (0x3U << RTOS_TIMER_CON_CLK_Pos)
#define RTOS_TIMER_CON_CLK        RTOS_TIMER_CON_CLK_Msk
#define RTOS_TIMER_CON_CLK_0      (0x1U << RTOS_TIMER_CON_CLK_Pos)
#define RTOS_TIMER_CON_CLK_1      (0x2U << RTOS_TIMER_CON_CLK_Pos)

#define RTOS_TIMER_CON_MODE_Pos   (6U)
#define RTOS_TIMER_CON_MODE_Msk   (0x1U << RTOS_TIMER_CON_MODE_Pos)
#define RTOS_TIMER_CON_MODE       RTOS_TIMER_CON_MODE_Msk

#define RTOS_TIMER_CON_EN_Pos     (7U)
#define RTOS_TIMER_CON_EN_Msk     (0x1U << RTOS_TIMER_CON_EN_Pos)
#define RTOS_TIMER_CON_EN         RTOS_TIMER_CON_EN_Msk

/**
 * @brief General-Purpose Timer 32 bits
 */
typedef struct TIMER1 {
  __IOM uint32_t LD;      /*!< Timer load register                            */
  __IM  uint32_t VAL;     /*!< Timer value register                           */
  __IOM uint32_t CON;     /*!< Timer control register                         */
  __OM  uint8_t  CLRI;    /*!< Timer interrupt clear register                 */
  RESERVED(0[3], uint8_t);
  __IM  uint32_t CAP;     /*!< Timer capture register                         */
} TIMER1_t;

#define TIMER1_CON_SRCCLK_Pos     (0U)
#define TIMER1_CON_SRCCLK_Msk     (0xFU << TIMER1_CON_SRCCLK_Pos)
#define TIMER1_CON_SRCCLK_1       (0x0U << TIMER1_CON_SRCCLK_Pos)
#define TIMER1_CON_SRCCLK_16      (0x4U << TIMER1_CON_SRCCLK_Pos)
#define TIMER1_CON_SRCCLK_256     (0x8U << TIMER1_CON_SRCCLK_Pos)
#define TIMER1_CON_SRCCLK_32768   (0xFU << TIMER1_CON_SRCCLK_Pos)

#define TIMER1_CON_FORMAT_Pos     (4U)
#define TIMER1_CON_FORMAT_Msk     (0x3U << TIMER1_CON_FORMAT_Pos)
#define TIMER1_CON_FORMAT_BIN     (0x0U << TIMER1_CON_FORMAT_Pos)
#define TIMER1_CON_FORMAT_HMS1    (0x2U << TIMER1_CON_FORMAT_Pos)
#define TIMER1_CON_FORMAT_HMS2    (0x3U << TIMER1_CON_FORMAT_Pos)

#define TIMER1_CON_FORMAT_Pos     (4U)
#define TIMER1_CON_FORMAT_Msk     (0x3U << TIMER1_CON_FORMAT_Pos)

#define TIMER1_CON_PER_MODE_Pos   (6U)
#define TIMER1_CON_PER_MODE_Msk   (0x1U << TIMER1_CON_PER_MODE_Pos)
#define TIMER1_CON_PER_MODE       TIMER1_CON_PER_MODE_Msk

#define TIMER1_CON_ENABLE_Pos     (7U)
#define TIMER1_CON_ENABLE_Msk     (0x1U << TIMER1_CON_ENABLE_Pos)
#define TIMER1_CON_ENABLE         TIMER1_CON_ENABLE_Msk

#define TIMER1_CON_CNT_UP_Pos     (8U)
#define TIMER1_CON_CNT_UP_Msk     (0x1U << TIMER1_CON_CNT_UP_Pos)
#define TIMER1_CON_CNT_UP         TIMER1_CON_CNT_UP_Msk

#define TIMER1_CON_CLKSEL_Pos     (9U)
#define TIMER1_CON_CLKSEL_Msk     (0x7U << TIMER1_CON_CLKSEL_Pos)
#define TIMER1_CON_CLKSEL_HCLK    (0x0U << TIMER1_CON_CLKSEL_Pos)
#define TIMER1_CON_CLKSEL_32K     (0x1U << TIMER1_CON_CLKSEL_Pos)
#define TIMER1_CON_CLKSEL_UCLK    (0x2U << TIMER1_CON_CLKSEL_Pos)
#define TIMER1_CON_CLKSEL_P1      (0x3U << TIMER1_CON_CLKSEL_Pos)

#define TIMER1_CON_EV_RANGE_Pos   (12U)
#define TIMER1_CON_EV_RANGE_Msk   (0x1FU << TIMER1_CON_EV_RANGE_Pos)
#define TIMER1_CON_EV_RANGE       TIMER1_CON_EV_RANGE_Msk

#define TIMER1_CON_EV_SEL_Pos     (17U)
#define TIMER1_CON_EV_SEL_Msk     (0x1U << TIMER1_CON_EV_SEL_Pos)
#define TIMER1_CON_EV_SEL         TIMER1_CON_EV_SEL_Msk

/**
 * @brief WatchDog Timer (Timer2)
 */
typedef struct TIMER2 {
  __IOM uint16_t LD;      /*!< Timer load register                            */
  RESERVED(0, uint16_t);
  __IM  uint16_t VAL;     /*!< Timer value register                           */
  RESERVED(1, uint16_t);
  __IOM uint16_t CON;     /*!< Timer control register                         */
  RESERVED(2, uint16_t);
  __OM  uint8_t  CLRI;    /*!< Timer interrupt clear register                 */
  RESERVED(3[3], uint8_t);
} TIMER2_t;

#define TIMER2_CON_WDGIRQ_Pos     (1U)
#define TIMER2_CON_WDGIRQ_Msk     (0x1U << TIMER2_CON_WDGIRQ_Pos)
#define TIMER2_CON_WDGIRQ         TIMER2_CON_WDGIRQ_Msk

#define TIMER2_CON_CLKDIV_Pos     (2U)
#define TIMER2_CON_CLKDIV_Msk     (0x3U << TIMER2_CON_CLKDIV_Pos)
#define TIMER2_CON_CLKDIV_1       (0x0U << TIMER2_CON_CLKDIV_Pos)
#define TIMER2_CON_CLKDIV_16      (0x1U << TIMER2_CON_CLKDIV_Pos)
#define TIMER2_CON_CLKDIV_256     (0x2U << TIMER2_CON_CLKDIV_Pos)

#define TIMER2_CON_SECURE_Pos     (4U)
#define TIMER2_CON_SECURE_Msk     (0x1U << TIMER2_CON_SECURE_Pos)
#define TIMER2_CON_SECURE         TIMER2_CON_SECURE_Msk

#define TIMER2_CON_WDGMODE_Pos    (5U)
#define TIMER2_CON_WDGMODE_Msk    (0x1U << TIMER2_CON_WDGMODE_Pos)
#define TIMER2_CON_WDGMODE        TIMER2_CON_WDGMODE_Msk

#define TIMER2_CON_PER_MODE_Pos   (6U)
#define TIMER2_CON_PER_MODE_Msk   (0x1U << TIMER2_CON_PER_MODE_Pos)
#define TIMER2_CON_PER_MODE       TIMER2_CON_PER_MODE_Msk

#define TIMER2_CON_ENABLE_Pos     (7U)
#define TIMER2_CON_ENABLE_Msk     (0x1U << TIMER2_CON_ENABLE_Pos)
#define TIMER2_CON_ENABLE         TIMER2_CON_ENABLE_Msk

#define TIMER2_CON_CNT_UP_Pos     (8U)
#define TIMER2_CON_CNT_UP_Msk     (0x1U << TIMER2_CON_CNT_UP_Pos)
#define TIMER2_CON_CNT_UP         TIMER2_CON_CNT_UP_Msk

/*------------------------------------------------------------------------------
 *                          POWER CLOCK CONTROL
 *----------------------------------------------------------------------------*/
/**
 * @brief Power Clock Control
 */
typedef struct PCC_s {
  __OM  uint32_t POWKEY1;
  __IOM uint32_t POWCON0;
  __OM  uint32_t POWKEY2;
  __OM  uint32_t PLLKEY1;
  __IOM uint32_t PLLCON;
  __OM  uint32_t PLLKEY2;
  RESERVED(0[6], uint32_t);
  __OM  uint32_t POWKEY3;
  __IOM uint32_t POWCON1;
  __OM  uint32_t POWKEY4;
  __IOM uint32_t PSMCON;
  __IOM uint32_t CMPCON;
} PCC_t;

#define PCC_POWKEY1_VALUE         ((uint16_t)0x0001)
#define PCC_POWKEY2_VALUE         ((uint16_t)0x00F4)
#define PCC_POWKEY3_VALUE         ((uint16_t)0x0076)
#define PCC_POWKEY4_VALUE         ((uint16_t)0x00B1)
#define PCC_PLLKEY1_VALUE         ((uint16_t)0x00AA)
#define PCC_PLLKEY2_VALUE         ((uint16_t)0x0055)

/*------------------------------------------------------------------------------
 *                          BAND GAP REFERENCE
 *----------------------------------------------------------------------------*/
/**
 * @brief Band Gap Reference
 */
typedef struct REF {
  __IOM uint32_t CON;     /*!< Reference control register                     */
} REF_t;

/********************  Bit definition for REFCON register  ********************/
#define REFCON_OUT_EN_Pos         (0U)
#define REFCON_OUT_EN_Msk         (0x1UL << REFCON_OUT_EN_Pos)
#define REFCON_OUT_EN             REFCON_OUT_EN_Msk

/*------------------------------------------------------------------------------
 *                          ANALOG-TO-DIGITAL CONVERTER
 *----------------------------------------------------------------------------*/
/**
 * @brief The analog-to-digital converter (ADC)
 */
typedef struct ADC {
  __IOM uint32_t CON;     /*!< ADC control register                           */
  __IOM uint32_t CP;      /*!< ADC positive channel selection register        */
  __IOM uint32_t CN;      /*!< ADC negative channel selection register        */
  __IM  uint32_t STA;     /*!< ADC status register                            */
  __IM  uint32_t DAT;     /*!< ADC  data output register                      */
  __IOM uint32_t RST;     /*!< ADC reset register                             */
  RESERVED(0[6], uint32_t);
  __IOM uint32_t GN;      /*!< ADC gain calibration register                  */
  __IOM uint32_t OF;      /*!< ADC offset calibration register                */
  RESERVED(1[3], uint32_t);
  __IOM uint32_t TSCON;   /*!< Temperature sensor chopping enable register    */
  __IOM uint32_t TEMPREF; /*!< Temperature sensor reference value             */
} ADC_t;

