koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
/********************  Bit definition for ADCCON register  ********************/
#define ADCCON_CONV_TYPE_Pos      (0U)
#define ADCCON_CONV_TYPE_Msk      (0x7UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE          ADCCON_CONV_TYPE_Msk
/* ADC conversion type */
#define ADCCON_CONV_TYPE_PIN      (0x0UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE_TMR1     (0x1UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE_TMR0     (0x2UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE_SINGLE   (0x3UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE_CONT     (0x4UL << ADCCON_CONV_TYPE_Pos)
#define ADCCON_CONV_TYPE_PLA      (0x5UL << ADCCON_CONV_TYPE_Pos)

#define ADCCON_CONV_MODE_Pos      (3U)
#define ADCCON_CONV_MODE_Msk      (0x3UL << ADCCON_CONV_MODE_Pos)
#define ADCCON_CONV_MODE          ADCCON_CONV_MODE_Msk
/* ADC conversion mode */
#define ADCCON_CONV_MODE_SE       (0x0UL << ADCCON_CONV_MODE_Pos)
#define ADCCON_CONV_MODE_DIF      (0x1UL << ADCCON_CONV_MODE_Pos)

#define ADCCON_PWR_UP_Pos         (5U)
#define ADCCON_PWR_UP_Msk         (0x1UL << ADCCON_PWR_UP_Pos)
#define ADCCON_PWR_UP             ADCCON_PWR_UP_Msk

#define ADCCON_CONV_START_Pos     (7U)
#define ADCCON_CONV_START_Msk     (0x1UL << ADCCON_CONV_START_Pos)
#define ADCCON_CONV_START         ADCCON_CONV_START_Msk

#define ADCCON_ACQ_TIME_Pos       (8U)
#define ADCCON_ACQ_TIME_Msk       (0x3UL << ADCCON_ACQ_TIME_Pos)
#define ADCCON_ACQ_TIME           ADCCON_ACQ_TIME_Msk
/* ADC acquisition time */
#define ADCCON_ACQ_TIME_2C        (0x0UL << ADCCON_ACQ_TIME_Pos)
#define ADCCON_ACQ_TIME_4C        (0x1UL << ADCCON_ACQ_TIME_Pos)
#define ADCCON_ACQ_TIME_8C        (0x2UL << ADCCON_ACQ_TIME_Pos)
#define ADCCON_ACQ_TIME_16C       (0x3UL << ADCCON_ACQ_TIME_Pos)

#define ADCCON_CLK_DIV_Pos        (10U)
#define ADCCON_CLK_DIV_Msk        (0x7UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV            ADCCON_CLK_DIV_Msk
/* ADC clock speed */
#define ADCCON_CLK_DIV_1          (0x0UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV_2          (0x1UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV_4          (0x2UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV_8          (0x3UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV_16         (0x4UL << ADCCON_CLK_DIV_Pos)
#define ADCCON_CLK_DIV_32         (0x5UL << ADCCON_CLK_DIV_Pos)

#define ADCCON_CONV_TEMP_Pos      (13U)
#define ADCCON_CONV_TEMP_Msk      (0x1UL << ADCCON_CONV_TEMP_Pos)
#define ADCCON_CONV_TEMP          ADCCON_CONV_TEMP_Msk

/********************  Bit definition for ADCCP  register  ********************/
#define ADCCP_SEL_CHN_P_Pos       (0U)
#define ADCCP_SEL_CHN_P_Msk       (0x1FUL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P           ADCCP_SEL_CHN_P_Msk
/* Positive channel selection bits */
#define ADCCP_SEL_CHN_P_ADC0      (0x00UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC1      (0x01UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC2      (0x02UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC3      (0x03UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC4      (0x04UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC5      (0x05UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC6      (0x06UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC7      (0x07UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC8      (0x08UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC9      (0x09UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC10     (0x0AUL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_ADC12     (0x0CUL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_DAC0      (0x0EUL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_DAC1      (0x0FUL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_TEMP      (0x10UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_AGND      (0x11UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_IREF      (0x12UL << ADCCP_SEL_CHN_P_Pos)
#define ADCCP_SEL_CHN_P_AVDD      (0x13UL << ADCCP_SEL_CHN_P_Pos)

/********************  Bit definition for ADCCN  register  ********************/
#define ADCCP_SEL_CHN_N_Pos       (0U)
#define ADCCP_SEL_CHN_N_Msk       (0x1FUL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N           ADCCP_SEL_CHN_N_Msk
/* Negative channel selection bits */
#define ADCCP_SEL_CHN_N_ADC0      (0x00UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC1      (0x01UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC2      (0x02UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC3      (0x03UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC4      (0x04UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC5      (0x05UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC6      (0x06UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC7      (0x07UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC8      (0x08UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC9      (0x09UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC10     (0x0AUL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_ADC12     (0x0CUL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_DAC1      (0x0FUL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_TEMP      (0x10UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_AGND      (0x11UL << ADCCP_SEL_CHN_N_Pos)
#define ADCCP_SEL_CHN_N_IREF      (0x12UL << ADCCP_SEL_CHN_N_Pos)

/********************  Bit definition for ADCSTA register  ********************/
#define ADCSTA_READY_Pos          (0U)
#define ADCSTA_READY_Msk          (0x1UL << ADCSTA_READY_Pos)
#define ADCSTA_READY              ADCSTA_READY_Msk

/********************  Bit definition for ADCDAT register  ********************/
#define ADCDAT_DATA_Pos           (16U)
#define ADCDAT_DATA_Msk           (0xFFFFUL << ADCDAT_DATA_Pos)
#define ADCDAT_DATA               ADCDAT_DATA_Msk

/********************  Bit definition for ADCRST register  ********************/
#define ADCRST_VALUE_Pos          (0U)
#define ADCRST_VALUE_Msk          (0xFFU << ADCRST_VALUE_Pos)
#define ADCRST_VALUE              ADCRST_VALUE_Msk

/********************  Bit definition for TSCON register  *********************/
#define TSCON_EN_Pos              (0U)
#define TSCON_EN_Msk              (0x1U << TSCON_EN_Pos)
#define TSCON_EN                  TSCON_EN_Msk

/********************  Bit definition for TEMPREF register  *******************/
#define TEMPREF_OFFSET_Pos        (0U)
#define TEMPREF_OFFSET_Msk        (0xFFU << TEMPREF_OFFSET_Pos)
#define TEMPREF_OFFSET            TEMPREF_OFFSET_Msk

#define TEMPREF_SIGN_Pos          (8U)
#define TEMPREF_SIGN_Msk          (0x1U << TEMPREF_SIGN_Pos)
#define TEMPREF_SIGN              TEMPREF_SIGN_Msk

/*------------------------------------------------------------------------------
 *                          DIGITAL-TO-ANALOG CONVERTER
 *----------------------------------------------------------------------------*/
/**
 * @brief The digital-to-analog converter (DAC)
 */
typedef struct DAC {
  __IOM uint32_t CON;     /*!< DAC control register                           */
  __IOM uint32_t DAT;     /*!< DAC data register                              */
} DAC_t;

/********************  Bit definition for DACCON register  ********************/
#define DACCON_RANGE_Pos          (0U)
#define DACCON_RANGE_Msk          (0x3UL << DACCON_RANGE_Pos)
#define DACCON_RANGE              DACCON_RANGE_Msk
/* DAC range */
#define DACCON_RANGE_TRIS         (0x0UL << DACCON_RANGE_Pos)
#define DACCON_RANGE_VREF         (0x2UL << DACCON_RANGE_Pos)
#define DACCON_RANGE_AVDD         (0x3UL << DACCON_RANGE_Pos)

