koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
#define DACCON_CLR_Pos            (4U)
#define DACCON_CLR_Msk            (0x1UL << DACCON_CLR_Pos)
#define DACCON_CLR                DACCON_CLR_Msk

#define DACCON_CLK_Pos            (5U)
#define DACCON_CLK_Msk            (0x1UL << DACCON_CLK_Pos)
#define DACCON_CLK                DACCON_CLK_Msk

#define DACCON_BYPASS_Pos         (6U)
#define DACCON_BYPASS_Msk         (0x1UL << DACCON_BYPASS_Pos)
#define DACCON_BYPASS             DACCON_BYPASS_Msk

/********************  Bit definition for DACDAT register  ********************/
#define DACDAT_DATA_Pos           (16U)
#define DACDAT_DATA_Msk           (0xFFFUL << DACDAT_DATA_Pos)
#define DACDAT_DATA               DACDAT_DATA_Msk

/**
 * @brief DAC Buffers in Operational Amplifier Mode
 */
typedef struct DACB {
  __OM  uint32_t KEY0;    /*!< DAC KEY0 register                              */
  __IOM uint32_t CFG;     /*!< DAC configuration register                     */
  __OM  uint32_t KEY1;    /*!< DAC KEY1 register                              */
} DACB_t;

/********************  Bit definition for DACBKEY0 register  ******************/
#define DACBKEY0_VALUE            ((uint16_t)0x9AU)

/********************  Bit definition for DACBCFG  register  ******************/
#define DACBCFG_DAC0_Pos          (0U)
#define DACBCFG_DAC0_Msk          (0x1UL << DACBCFG_DAC0_Pos)
#define DACBCFG_DAC0              DACBCFG_DAC0_Msk

#define DACBCFG_DAC1_Pos          (1U)
#define DACBCFG_DAC1_Msk          (0x1UL << DACBCFG_DAC1_Pos)
#define DACBCFG_DAC1              DACBCFG_DAC1_Msk

#define DACBCFG_DAC2_Pos          (2U)
#define DACBCFG_DAC2_Msk          (0x1UL << DACBCFG_DAC2_Pos)
#define DACBCFG_DAC2              DACBCFG_DAC2_Msk

#define DACBCFG_DAC3_Pos          (3U)
#define DACBCFG_DAC3_Msk          (0x1UL << DACBCFG_DAC3_Pos)
#define DACBCFG_DAC3              DACBCFG_DAC3_Msk

/********************  Bit definition for DACBKEY1 register  ******************/
#define DACBKEY1_VALUE            ((uint16_t)0x0CU)

/*------------------------------------------------------------------------------
 *                               I2C
 *----------------------------------------------------------------------------*/
/**
 * @brief I2C
 */
typedef struct I2C_s {
  __IOM uint16_t MCON;
  RESERVED(0, uint16_t);
  __IM  uint16_t MSTA;
  RESERVED(1, uint16_t);
  __IM  uint8_t  MRX;
  RESERVED(2[3], uint8_t );
  __OM  uint8_t  MTX;
  RESERVED(3[3], uint8_t );
  __IOM uint16_t MCNT0;
  RESERVED(4, uint16_t);
  __IM  uint8_t  MCNT1;
  RESERVED(5[3], uint8_t );
  __IOM uint8_t  ADR0;
  RESERVED(6[3], uint8_t );
  __IOM uint8_t  ADR1;
  RESERVED(7[7], uint8_t );
  __IOM uint16_t DIV;
  RESERVED(8, uint16_t);
  __IOM uint16_t SCON;
  RESERVED(9, uint16_t);
  __IOM uint16_t SSTA;
  RESERVED(10, uint16_t);
  __IM  uint8_t SRX;
  RESERVED(11[3], uint8_t );
  __OM  uint8_t STX;
  RESERVED(12[3], uint8_t );
  __IOM uint8_t ALT;
  RESERVED(13[3], uint8_t );
  __IOM uint8_t ID0;
  RESERVED(14[3], uint8_t );
  __IOM uint8_t ID1;
  RESERVED(15[3], uint8_t );
  __IOM uint8_t ID2;
  RESERVED(16[3], uint8_t );
  __IOM uint8_t ID3;
  RESERVED(17[3], uint8_t );
  __IOM uint16_t FSTA;
} I2C_t;

/*******************  Bit definition for I2CMCON register  ********************/
#define I2CMCON_MEN_Pos           (0U)
#define I2CMCON_MEN_Msk           (0x1UL << I2CMCON_MEN_Pos)
#define I2CMCON_MEN                         I2CMCON_MEN_Msk

#define I2CMCON_BD_Pos            (1U)
#define I2CMCON_BD_Msk            (0x1UL << I2CMCON_BD_Pos)
#define I2CMCON_BD                          I2CMCON_BD_Msk

#define I2CMCON_ILEN_Pos          (2U)
#define I2CMCON_ILEN_Msk          (0x1UL << I2CMCON_ILEN_Pos)
#define I2CMCON_ILEN                        I2CMCON_ILEN_Msk

#define I2CMCON_STRETCH_Pos       (3U)
#define I2CMCON_STRETCH_Msk       (0x1UL << I2CMCON_STRETCH_Pos)
#define I2CMCON_STRETCH                     I2CMCON_STRETCH_Msk

#define I2CMCON_MRENI_Pos         (4U)
#define I2CMCON_MRENI_Msk         (0x1UL << I2CMCON_MRENI_Pos)
#define I2CMCON_MRENI                       I2CMCON_MRENI_Msk

#define I2CMCON_MTENI_Pos         (5U)
#define I2CMCON_MTENI_Msk         (0x1UL << I2CMCON_MTENI_Pos)
#define I2CMCON_MTENI                       I2CMCON_MTENI_Msk

#define I2CMCON_ALENI_Pos         (6U)
#define I2CMCON_ALENI_Msk         (0x1UL << I2CMCON_ALENI_Pos)
#define I2CMCON_ALENI                       I2CMCON_ALENI_Msk

#define I2CMCON_NACKENI_Pos       (7U)
#define I2CMCON_NACKENI_Msk       (0x1UL << I2CMCON_NACKENI_Pos)
#define I2CMCON_NACKENI                     I2CMCON_NACKENI_Msk

#define I2CMCON_MCENI_Pos         (8U)
#define I2CMCON_MCENI_Msk         (0x1UL << I2CMCON_MCENI_Pos)
#define I2CMCON_MCENI                       I2CMCON_MCENI_Msk

/*******************  Bit definition for I2CMSTA register  ********************/
#define I2CMSTA_TFSTA_Pos         (0U)
#define I2CMSTA_TFSTA_Msk         (0x3UL << I2CMSTA_TFSTA_Pos)
#define I2CMSTA_TFSTA             I2CMSTA_TFSTA_Msk
#define I2CMSTA_TFSTA_0           (0x1UL << I2CMSTA_TFSTA_Pos)
#define I2CMSTA_TFSTA_1           (0x2UL << I2CMSTA_TFSTA_Pos)
#define I2CMSTA_TXQ_Pos           (2U)
#define I2CMSTA_TXQ_Msk           (0x1UL << I2CMSTA_TXQ_Pos)
#define I2CMSTA_TXQ               I2CMSTA_TXQ_Msk
#define I2CMSTA_RXQ_Pos           (3U)
#define I2CMSTA_RXQ_Msk           (0x1UL << I2CMSTA_RXQ_Pos)
#define I2CMSTA_RXQ               I2CMSTA_RXQ_Msk
#define I2CMSTA_NADDR_Pos         (4U)
#define I2CMSTA_NADDR_Msk         (0x1UL << I2CMSTA_NADDR_Pos)
#define I2CMSTA_NADDR             I2CMSTA_NADDR_Msk
#define I2CMSTA_AL_Pos            (5U)
#define I2CMSTA_AL_Msk            (0x1UL << I2CMSTA_AL_Pos)
#define I2CMSTA_AL                I2CMSTA_AL_Msk
#define I2CMSTA_BUSY_Pos          (6U)
#define I2CMSTA_BUSY_Msk          (0x1UL << I2CMSTA_BUSY_Pos)
#define I2CMSTA_BUSY              I2CMSTA_BUSY_Msk
#define I2CMSTA_NDATA_Pos         (7U)
#define I2CMSTA_NDATA_Msk         (0x1UL << I2CMSTA_NDATA_Pos)
#define I2CMSTA_NDATA             I2CMSTA_NDATA_Msk
#define I2CMSTA_TC_Pos            (8U)
#define I2CMSTA_TC_Msk            (0x1UL << I2CMSTA_TC_Pos)
#define I2CMSTA_TC                I2CMSTA_TC_Msk
#define I2CMSTA_RXFO_Pos          (9U)
#define I2CMSTA_RXFO_Msk          (0x1UL << I2CMSTA_RXFO_Pos)
#define I2CMSTA_RXFO              I2CMSTA_RXFO_Msk
#define I2CMSTA_BBUSY_Pos         (10U)
#define I2CMSTA_BBUSY_Msk         (0x1UL << I2CMSTA_BBUSY_Pos)
#define I2CMSTA_BBUSY             I2CMSTA_BBUSY_Msk

