koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
/*******************  Bit definition for I2CID0 register  *********************/
#define I2CID0_Pos                (0U)
#define I2CID0_Msk                (0xFFUL << I2CID0_Pos)
#define I2CID0                    I2CID0_Msk

/*******************  Bit definition for I2CID1 register  *********************/
#define I2CID1_Pos                (0U)
#define I2CID1_Msk                (0xFFUL << I2CID1_Pos)
#define I2CID1                    I2CID1_Msk

/*******************  Bit definition for I2CID2 register  *********************/
#define I2CID2_Pos                (0U)
#define I2CID2_Msk                (0xFFUL << I2CID2_Pos)
#define I2CID2                    I2CID2_Msk

/*******************  Bit definition for I2CID3 register  *********************/
#define I2CID3_Pos                (0U)
#define I2CID3_Msk                (0xFFUL << I2CID3_Pos)
#define I2CID3                    I2CID3_Msk

/*******************  Bit definition for I2CFSTA register  ********************/
#define I2CFSTA_STXSTA_Pos        (0U)
#define I2CFSTA_STXSTA_Msk        (0x3UL << I2CFSTA_STXSTA_Pos)
#define I2CFSTA_STXSTA_EMPTY      (0x0UL << I2CFSTA_STXSTA_Pos)
#define I2CFSTA_STXSTA_ONEBYTE    (0x2UL << I2CFSTA_STXSTA_Pos)
#define I2CFSTA_STXSTA_TWOBYTES   (0x3UL << I2CFSTA_STXSTA_Pos)

#define I2CFSTA_SRXSTA_Pos        (2U)
#define I2CFSTA_SRXSTA_Msk        (0x3UL << I2CFSTA_SRXSTA_Pos)
#define I2CFSTA_SRXSTA_EMPTY      (0x0UL << I2CFSTA_SRXSTA_Pos)
#define I2CFSTA_SRXSTA_ONEBYTE    (0x2UL << I2CFSTA_SRXSTA_Pos)
#define I2CFSTA_SRXSTA_TWOBYTES   (0x3UL << I2CFSTA_SRXSTA_Pos)

#define I2CFSTA_MTXSTA_Pos        (4U)
#define I2CFSTA_MTXSTA_Msk        (0x3UL << I2CFSTA_MTXSTA_Pos)
#define I2CFSTA_MTXSTA_EMPTY      (0x0UL << I2CFSTA_MTXSTA_Pos)
#define I2CFSTA_MTXSTA_ONEBYTE    (0x2UL << I2CFSTA_MTXSTA_Pos)
#define I2CFSTA_MTXSTA_TWOBYTES   (0x3UL << I2CFSTA_MTXSTA_Pos)

#define I2CFSTA_MRXSTA_Pos        (6U)
#define I2CFSTA_MRXSTA_Msk        (0x3UL << I2CFSTA_MRXSTA_Pos)
#define I2CFSTA_MRXSTA_EMPTY      (0x0UL << I2CFSTA_MRXSTA_Pos)
#define I2CFSTA_MRXSTA_ONEBYTE    (0x2UL << I2CFSTA_MRXSTA_Pos)
#define I2CFSTA_MRXSTA_TWOBYTES   (0x3UL << I2CFSTA_MRXSTA_Pos)

#define I2CFSTA_FSTX_Pos          (8U)
#define I2CFSTA_FSTX_Msk          (0x1UL << I2CFSTA_FSTX_Pos)
#define I2CFSTA_FSTX              I2CFSTA_FSTX_Msk

#define I2CFSTA_FMTX_Pos          (9U)
#define I2CFSTA_FMTX_Msk          (0x1UL << I2CFSTA_FMTX_Pos)
#define I2CFSTA_FMTX              I2CFSTA_FMTX_Msk

/*------------------------------------------------------------------------------
 *                               PLA
 *----------------------------------------------------------------------------*/

/**
 * @brief PROGRAMMABLE LOGIC ARRAY (PLA)
 */
typedef struct PLA {
  __IOM uint16_t PLAELM0;   // PLA Element 0 control register.
  RESERVED(0, uint16_t);
  __IOM uint16_t PLAELM1;   // PLA Element 1 control register.
  RESERVED(1, uint16_t);
  __IOM uint16_t PLAELM2;   // PLA Element 2 control register.
  RESERVED(2, uint16_t);
  __IOM uint16_t PLAELM3;   // PLA Element 3 control register.
  RESERVED(3, uint16_t);
  __IOM uint16_t PLAELM4;   // PLA Element 4 control register.
  RESERVED(4, uint16_t);
  __IOM uint16_t PLAELM5;   // PLA Element 5 control register.
  RESERVED(5, uint16_t);
  __IOM uint16_t PLAELM6;   // PLA Element 6 control register.
  RESERVED(6, uint16_t);
  __IOM uint16_t PLAELM7;   // PLA Element 7 control register.
  RESERVED(7, uint16_t);
  __IOM uint16_t PLAELM8;   // PLA Element 8 control register.
  RESERVED(8, uint16_t);
  __IOM uint16_t PLAELM9;   // PLA Element 9 control register.
  RESERVED(9, uint16_t);
  __IOM uint16_t PLAELM10;  // PLA Element 10 control register.
  RESERVED(10, uint16_t);
  __IOM uint16_t PLAELM11;  // PLA Element 11 control register.
  RESERVED(11, uint16_t);
  __IOM uint16_t PLAELM12;  // PLA Element 12 control register.
  RESERVED(12, uint16_t);
  __IOM uint16_t PLAELM13;  // PLA Element 13 control register.
  RESERVED(13, uint16_t);
  __IOM uint16_t PLAELM14;  // PLA Element 14 control register.
  RESERVED(14, uint16_t);
  __IOM uint16_t PLAELM15;  // PLA Element 15 control register.
  RESERVED(15, uint16_t);
  __IOM uint8_t  PLACLK;    // PLA clock select register.
  RESERVED(16[3], uint8_t);
  __IOM uint32_t PLAIRQ;    // PLA interrupt control register.
  __IOM uint32_t PLAADC;    // PLA ADC trigger control register.
  __IOM uint32_t PLADIN;    // PLA data in register.
  __IM  uint32_t PLADOUT;   // PLA data out register.
  __OM  uint8_t  PLALCK;    // PLA lock register.
  RESERVED(17[3], uint8_t);
} PLA_t;

/*------------------------------------------------------------------------------
 *                          PULSE-WIDTH MODULATOR
 *----------------------------------------------------------------------------*/

/**
 * @brief PULSE-WIDTH MODULATOR (PWM)
 */
typedef struct PWM {
  __IOM uint32_t PWMCON1;   // PWM Control Register 1
  __IOM uint32_t PWM0COM0;  // Compare Register 0 for PWM Output 0 and PWM Output 1
  __IOM uint32_t PWM0COM1;  // Compare Register 1 for PWM Output 0 and PWM Output 1
  __IOM uint32_t PWM0COM2;  // Compare Register 2 for PWM Output 0 and PWM Output 1
  __IOM uint32_t PWM0LEN;   // Frequency control for PWM Output 0 and PWM Output 1
  __IOM uint32_t PWM1COM0;  // Compare Register 0 for PWM Output 2 and PWM Output 3
  __IOM uint32_t PWM1COM1;  // Compare Register 1 for PWM Output 2 and PWM Output 3
  __IOM uint32_t PWM1COM2;  // Compare Register 2 for PWM Output 2 and PWM Output 3
  __IOM uint32_t PWM1LEN;   // Frequency control for PWM Output 2 and PWM Output 3
  __IOM uint32_t PWM2COM0;  // Compare Register 0 for PWM Output 4
  __IOM uint32_t PWM2COM1;  // Compare Register 1 for PWM Output 4
  RESERVED(0, uint32_t);
  __IOM uint32_t PWM2LEN;   // Frequency control for PWM Output 4
  RESERVED(1, uint32_t);
  __OM  uint32_t PWMCLRI;   // PWM interrupt clear
} PWM_t;

/*******************  Bit definition for PWMCON1 register  ********************/
#define PWMCON1_PWMEN_Pos         (0U)
#define PWMCON1_PWMEN_Msk         (0x1UL << PWMCON1_PWMEN_Pos)
#define PWMCON1_PWMEN             PWMCON1_PWMEN_Msk

#define PWMCON1_HMODE_Pos         (1U)
#define PWMCON1_HMODE_Msk         (0x1UL << PWMCON1_HMODE_Pos)
#define PWMCON1_HMODE             PWMCON1_HMODE_Msk

#define PWMCON1_DIR_Pos           (2U)
#define PWMCON1_DIR_Msk           (0x1UL << PWMCON1_DIR_Pos)
#define PWMCON1_DIR               PWMCON1_DIR_Msk

#define PWMCON1_LCOMP_Pos         (3U)
#define PWMCON1_LCOMP_Msk         (0x1UL << PWMCON1_LCOMP_Pos)
#define PWMCON1_LCOMP             PWMCON1_LCOMP_Msk

#define PWMCON1_HOFF_Pos          (4U)
#define PWMCON1_HOFF_Msk          (0x1UL << PWMCON1_HOFF_Pos)
#define PWMCON1_HOFF              PWMCON1_HOFF_Msk

