koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
#define PWMCON1_POINV_Pos         (5U)
#define PWMCON1_POINV_Msk         (0x1UL << PWMCON1_POINV_Pos)
#define PWMCON1_POINV             PWMCON1_POINV_Msk

#define PWMCON1_PWMCP_Pos         (6U)
#define PWMCON1_PWMCP_Msk         (0x7UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_2       (0x0UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_4       (0x1UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_8       (0x2UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_16      (0x3UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_32      (0x4UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_64      (0x5UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_128     (0x6UL << PWMCON1_PWMCP_Pos)
#define PWMCON1_PWMCP_DIV_256     (0x7UL << PWMCON1_PWMCP_Pos)

#define PWMCON1_ENA_Pos           (9U)
#define PWMCON1_ENA_Msk           (0x1UL << PWMCON1_ENA_Pos)
#define PWMCON1_ENA               PWMCON1_ENA_Msk

#define PWMCON1_PWMTRIP_Pos       (10U)
#define PWMCON1_PWMTRIP_Msk       (0x1UL << PWMCON1_PWMTRIP_Pos)
#define PWMCON1_PWMTRIP           PWMCON1_PWMTRIP_Msk

#define PWMCON1_PWM1INV_Pos       (11U)
#define PWMCON1_PWM1INV_Msk       (0x1UL << PWMCON1_PWM1INV_Pos)
#define PWMCON1_PWM1INV           PWMCON1_PWM1INV_Msk

#define PWMCON1_PWM3INV_Pos       (12U)
#define PWMCON1_PWM3INV_Msk       (0x1UL << PWMCON1_PWM3INV_Pos)
#define PWMCON1_PWM3INV           PWMCON1_PWM3INV_Msk

#define PWMCON1_SYNC_Pos          (14U)
#define PWMCON1_SYNC_Msk          (0x1UL << PWMCON1_SYNC_Pos)
#define PWMCON1_SYNC              PWMCON1_SYNC_Msk

/*******************  Bit definition for PWM0COM0 register  *******************/
#define PWM0COM0_VAL_Pos          (0U)
#define PWM0COM0_VAL_Msk          (0xFFFFUL << PWM0COM0_VAL_Pos)

/*******************  Bit definition for PWM0COM1 register  *******************/
#define PWM0COM1_VAL_Pos          (0U)
#define PWM0COM1_VAL_Msk          (0xFFFFUL << PWM0COM1_VAL_Pos)

/*******************  Bit definition for PWM0COM2 register  *******************/
#define PWM0COM2_VAL_Pos          (0U)
#define PWM0COM2_VAL_Msk          (0xFFFFUL << PWM0COM2_VAL_Pos)

/*******************  Bit definition for PWM0LEN register  ********************/
#define PWM0LEN_VAL_Pos           (0U)
#define PWM0LEN_VAL_Msk           (0xFFFFUL << PWM0LEN_VAL_Pos)

/*******************  Bit definition for PWM1COM0 register  *******************/
#define PWM1COM0_VAL_Pos          (0U)
#define PWM1COM0_VAL_Msk          (0xFFFFUL << PWM1COM0_VAL_Pos)

/*******************  Bit definition for PWM1COM1 register  *******************/
#define PWM1COM1_VAL_Pos          (0U)
#define PWM1COM1_VAL_Msk          (0xFFFFUL << PWM1COM1_VAL_Pos)

/*******************  Bit definition for PWM1COM2 register  *******************/
#define PWM1COM2_VAL_Pos          (0U)
#define PWM1COM2_VAL_Msk          (0xFFFFUL << PWM1COM2_VAL_Pos)

/*******************  Bit definition for PWM1LEN register  ********************/
#define PWM1LEN_VAL_Pos           (0U)
#define PWM1LEN_VAL_Msk           (0xFFFFUL << PWM1LEN_VAL_Pos)

/*******************  Bit definition for PWM2COM0 register  *******************/
#define PWM2COM0_VAL_Pos          (0U)
#define PWM2COM0_VAL_Msk          (0xFFFFUL << PWM2COM0_VAL_Pos)

/*******************  Bit definition for PWM2COM1 register  *******************/
#define PWM2COM1_VAL_Pos          (0U)
#define PWM2COM1_VAL_Msk          (0xFFFFUL << PWM2COM1_VAL_Pos)

/*******************  Bit definition for PWM2LEN register  ********************/
#define PWM2LEN_VAL_Pos           (0U)
#define PWM2LEN_VAL_Msk           (0xFFFFUL << PWM2LEN_VAL_Pos)

/*******************  Bit definition for PWMCLRI register  ********************/
#define PWMCLRI_VAL_Pos           (0U)
#define PWMCLRI_VAL_Msk           (0xFFFFUL << PWMCLRI_VAL_Pos)


/*------------------------------------------------------------------------------
 *                          FLASH CONTROL
 *----------------------------------------------------------------------------*/
/**
 * @brief Flash Memory
 */
typedef struct FLASH_s {
  __IM  uint32_t STA;
  __IOM uint32_t MOD;
  __IOM uint32_t CON;
  __IOM uint32_t DAT;
  __IOM uint32_t ADR;
  RESERVED(0, uint32_t);
  __IM  uint32_t SIGN;
  __IOM uint32_t PRO;
  __IOM uint32_t HIDE;
} FLASH_t;

/********************  Bit definition for FEESTA register  ********************/
#define FLASH_STA_PASS_Pos        (0U)
#define FLASH_STA_PASS_Msk        (0x1UL << FLASH_STA_PASS_Pos)
#define FLASH_STA_PASS            FLASH_STA_PASS_Msk
#define FLASH_STA_FAIL_Pos        (1U)
#define FLASH_STA_FAIL_Msk        (0x1UL << FLASH_STA_FAIL_Pos)
#define FLASH_STA_FAIL            FLASH_STA_FAIL_Msk
#define FLASH_STA_BUSY_Pos        (2U)
#define FLASH_STA_BUSY_Msk        (0x1UL << FLASH_STA_BUSY_Pos)
#define FLASH_STA_BUSY            FLASH_STA_BUSY_Msk
#define FLASH_STA_INT_Pos         (3U)
#define FLASH_STA_INT_Msk         (0x1UL << FLASH_STA_INT_Pos)
#define FLASH_STA_INT             FLASH_STA_INT_Msk

/********************  Bit definition for FEEMOD register  ********************/
#define FLASH_MOD_DIS_PROT_Pos    (3U)
#define FLASH_MOD_DIS_PROT_Msk    (0x1UL << FLASH_MOD_DIS_PROT_Pos)
#define FLASH_MOD_DIS_PROT        FLASH_MOD_DIS_PROT_Msk
#define FLASH_MOD_INT_EN_Pos      (4U)
#define FLASH_MOD_INT_EN_Msk      (0x1UL << FLASH_MOD_INT_EN_Pos)
#define FLASH_MOD_INT_EN          FLASH_MOD_INT_EN_Msk

/********************  Bit definition for FEECON register  ********************/
#define FLASH_CON_Pos             (0U)
#define FLASH_CON_Msk             (0xFFUL << FLASH_CON_Pos)
#define FLASH_CON                 FLASH_CON_Msk
#define FLASH_CMD_IDLE            ((uint8_t)0x00)
#define FLASH_CMD_SINGLE_READ     ((uint8_t)0x01)
#define FLASH_CMD_SINGLE_WRITE    ((uint8_t)0x02)
#define FLASH_CMD_ERASE_WRITE     ((uint8_t)0x03)
#define FLASH_CMD_SINGLE_VERIFY   ((uint8_t)0x04)
#define FLASH_CMD_SINGLE_ERASE    ((uint8_t)0x05)
#define FLASH_CMD_MASS_ERASE      ((uint8_t)0x06)
#define FLASH_CMD_SIGNATURE       ((uint8_t)0x0B)
#define FLASH_CMD_PROTECT         ((uint8_t)0x0C)
#define FLASH_CMD_PING            ((uint8_t)0x0F)

