koshkin-sergey/mbOS/Device/ADI/ADuC7023/Include/asm/aduc7023.h
/********************  Bit definition for FEEDAT register  ********************/
#define FLASH_DAT_Pos             (0U)
#define FLASH_DAT_Msk             (0xFFFFUL << FLASH_DAT_Pos)
#define FLASH_DAT                 FLASH_DAT_Msk

/********************  Bit definition for FEEADR register  ********************/
#define FLASH_ADR_Pos             (0U)
#define FLASH_ADR_Msk             (0xFFFFUL << FLASH_ADR_Pos)
#define FLASH_ADR                 FLASH_ADR_Msk

/********************  Bit definition for FEESIGN register  *******************/
#define FLASH_SIGN_Pos            (0U)
#define FLASH_SIGN_Msk            (0xFFFFFFUL << FLASH_SIGN_Pos)
#define FLASH_SIGN                FLASH_SIGN_Msk

/*------------------------------------------------------------------------------
 *                          MEMORY MAP
 *----------------------------------------------------------------------------*/

#define FLASH_BASE            0x00080000UL
#define FLASH_END             0x0008F7FFUL
#define RAM_BASE              0x00010000UL

#define IRQ_BASE              0xFFFF0000UL  /*!< IRQ Address Base             */
#define FIQ_BASE              0xFFFF0100UL  /*!< FIQ Address Base             */
#define SYS_BASE              0xFFFF0220UL  /*!< SYS Address Base             */
#define TIMER0_BASE           0xFFFF0300UL  /*!< Timer0 Address Base          */
#define TIMER1_BASE           0xFFFF0320UL  /*!< Timer1 Address Base          */
#define TIMER2_BASE           0xFFFF0360UL  /*!< Timer2 Address Base          */
#define PCC_BASE              0xFFFF0404UL  /*!< PLL/PSM Base Address         */
#define REF_BASE              0xFFFF048CUL  /*!< REF Address Base             */
#define ADC_BASE              0xFFFF0500UL  /*!< ADC Address Base             */
#define DAC0_BASE             0xFFFF0600UL  /*!< DAC0 Address Base            */
#define DAC1_BASE             0xFFFF0608UL  /*!< DAC1 Address Base            */
#define DAC2_BASE             0xFFFF0610UL  /*!< DAC2 Address Base            */
#define DAC3_BASE             0xFFFF0618UL  /*!< DAC3 Address Base            */
#define DACB_BASE             0xFFFF0650UL  /*!< DACB Address Base            */
#define I2C0_BASE             0xFFFF0800UL  /*!< I2C0 Base Address            */
#define I2C1_BASE             0xFFFF0900UL  /*!< I2C1 Base Address            */
#define SPI_BASE              0xFFFF0A00UL  /*!< SPI Base Address             */
#define PLA_BASE              0xFFFF0B00UL  /*!< PLA Base Address             */
#define PWM_BASE              0xFFFF0F80UL  /*!< PWM Base Address             */
#define FLASH_CTL_BASE        0xFFFFF800UL  /*!< FLASH Address Base           */

#define IRQ                   ((IRQ_t *)        IRQ_BASE)
#define FIQ                   ((FIQ_t *)        FIQ_BASE)
#define SYS                   ((SYS_t *)        SYS_BASE)
#define RTOS_TIMER            ((RTOS_TIMER_t *) TIMER0_BASE)
#define TIM1                  ((TIMER1_t *)     TIMER1_BASE)
#define TIM2                  ((TIMER2_t *)     TIMER2_BASE)
#define PCC                   ((PCC_t *)        PCC_BASE)
#define REF                   ((REF_t *)        REF_BASE)
#define ADC                   ((ADC_t *)        ADC_BASE)
#define DAC0                  ((DAC_t *)        DAC0_BASE)
#define DAC1                  ((DAC_t *)        DAC1_BASE)
#define DAC2                  ((DAC_t *)        DAC2_BASE)
#define DAC3                  ((DAC_t *)        DAC3_BASE)
#define DACB                  ((DACB_t *)       DACB_BASE)
#define I2C0                  ((I2C_t *)        I2C0_BASE)
#define I2C1                  ((I2C_t *)        I2C1_BASE)
#define PLA                   ((PLA_t *)        PLA_BASE)
#define PWM                   ((PWM_t *)        PWM_BASE)
#define FLASH                 ((FLASH_t *)      FLASH_CTL_BASE)

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))
#define READ_REG(REG)         ((REG))
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

#ifdef __cplusplus
}
#endif

#endif /* ADUC7023_H_ */
